#include "ffcc/THPSimple.h"
#include "ffcc/file.h"
#include "dolphin/dvd.h"
#include "dolphin/thp/THPDraw.h"
#include "dolphin/thp/THPFile.h"
#include "dolphin/thp/THPInfo.h"
#include "dolphin/thp/THPPlayer.h"
#include "dolphin/thp/THPBuffer.h"
#include "dolphin/thp/THPVideoDecode.h"
#include "dolphin/thp/THPAudio.h"
#include <dolphin/ai.h>
#include <dolphin/os.h>
#include <dolphin/os/OSCache.h>
#include <string.h>

struct THPSimpleControl {
    DVDFileInfo fileInfo;          // 0x00
    THPHeader header;              // 0x3C
    THPFrameCompInfo compInfo;     // 0x6C
    THPVideoInfo videoInfo;        // 0x80
    THPAudioInfo audioInfo;        // 0x8C
    u32 unk_9C;                    // 0x9C
    u32 isOpen;                    // 0xA0
    u8 isPreLoaded;                // 0xA4
    u8 isBufferSet;                // 0xA5
    u8 isLooping;                  // 0xA6
    u8 hasAudio;                   // 0xA7
    s32 readOffset;                // 0xA8
    s32 readError;                 // 0xAC
    s32 isReadFrameAsync;          // 0xB0
    s32 readFrame;                 // 0xB4
    s32 readIndex;                 // 0xB8
    s32 readSize;                  // 0xBC
    s32 curAudioTrack;             // 0xC0
    f32 unk_C4;                    // 0xC4
    f32 unk_C8;                    // 0xC8
    f32 unk_CC;                    // 0xCC
    s32 unk_D0;                    // 0xD0
    THPReadBuffer readBuffer[8];   // 0xD4
    u32* yImage;                   // 0x134
    u32* uImage;                   // 0x138
    u32* vImage;                   // 0x13C
    s32 curFrame;                  // 0x140
    THPAudioBuffer audioBuffer[3]; // 0x144
    s32 audioDecodeIndex;          // 0x168
    s32 audioPlayIndex;            // 0x16C
    u8 pad170[4];                  // 0x170
};

THPSimpleControl SimpleControl;
static THPVideoInfo sVideoInfoWork;
static THPAudioInfo sAudioInfoWork;
static u8 sReadBuffer[0x40];

extern s32 lbl_8032EE48;
extern s32 lbl_8032EE4C;
extern void (*lbl_8032EE50)(void);
extern s16* lbl_8032EE54;
extern s16* lbl_8032EE58;
extern s32 lbl_8032EE5C;
extern u16 lbl_802111E8[];
extern s16 WorkBuffer_32_[];

/*
 * --INFO--
 * Address:	TODO
 * Size:	TODO
 */
void checkError()
{
    s32 status = DVDGetCommandBlockStatus(&SimpleControl.fileInfo.cb);

    if ((status == 0xB) || ((status - 4U) < 3) || (status == -1)) {
        File.DrawError(SimpleControl.fileInfo, status);
    }
}

/*
 * --INFO--
 * Address:	TODO
 * Size:	TODO
 */
void _kami_DVDREAD(DVDFileInfo*, void*, long, long)
{
	// TODO
}

/*
 * --INFO--
 * PAL Address: 0x8010585c
 * PAL Size: 288b
 * EN Address: TODO
 * EN Size: TODO
 * JP Address: TODO
 * JP Size: TODO
 */
s32 THPSimpleInit(s32 audioMixMode)
{
    u32 interruptState;
